apache/nuttx/arch/arm/src/stm32g0/hardware/stm32g0_rcc.h
#define RCC_IOPENR_IOPAEN           (1 << 0)  /* Bit 0: IO port A enable */
#define RCC_IOPENR_IOPBEN           (1 << 1)  /* Bit 1: IO port B enable */
#define RCC_IOPENR_IOPCEN           (1 << 2)  /* Bit 2: IO port C enable */
#define RCC_IOPENR_IOPDEN           (1 << 3)  /* Bit 3: IO port D enable */
                                              /* Bits 4: Reserved */
#define RCC_IOPENR_IOPFEN           (1 << 5)  /* Bit 5: IO port F enable */

/* AHB Peripheral Clock enable register */

#define RCC_AHBENR_DMA1EN           (1 << 0)  /* Bit 0: DMA 1 enable */
#define RCC_AHBENR_DMA2EN           (1 << 1)  /* Bit 1: DMA 2 enable */
                                              /* Bits 2-7: Reserved */
#define RCC_AHBENR_MIFEN            (1 << 8)  /* Bit 8: Memory interface enable */
                                              /* Bits 9-11: Reserved */
#define RCC_AHBENR_CRCEN            (1 << 12) /* Bit 12: Memory interface enable */
                                              /* Bits 13-15: Reserved */
#define RCC_AHBENR_AESEN            (1 << 16) /* Bit 16: Touch sensing enable */
                                              /* Bit 17: Reserved */
#define RCC_AHBENR_RNGEN            (1 << 18) /* Bit 18: Random number generator module enable */
                                              /* Bits 19-31: Reserved */

/* APB1 Peripheral Clock enable register */

#define RCC_APB1ENR_TIM2EN          (1 << 0)  /* Bit 0:  Timer 2 enable */
#define RCC_APB1ENR_TIM3EN          (1 << 1)  /* Bit 1:  Timer 3 enable */
                                              /* Bits 2-3: Reserved */
#define RCC_APB1ENR_TIM6EN          (1 << 4)  /* Bit 4:  Timer 6 enable */
#define RCC_APB1ENR_TIM7EN          (1 << 5)  /* Bit 5:  Timer 7 enable */
                                              /* Bits 6-12: Reserved */
#define RCC_APB1ENR_USBEN           (1 << 13) /* Bit 13: USB enable */
#define RCC_APB1ENR_SPI2EN          (1 << 14) /* Bit 14: SPI 2 enable */
                                              /* Bit 15: Reserved */
#define RCC_APB1ENR_CRSEN           (1 << 16) /* Bit 16: CRS enable */
#define RCC_APB1ENR_USART2EN        (1 << 17) /* Bit 17: USART 2 enable */
#define RCC_APB1ENR_USART3EN        (1 << 18) /* Bit 18: USART 3 enable */
#define RCC_APB1ENR_USART4EN        (1 << 19) /* Bit 19: USART 4 enable */
#define RCC_APB1ENR_LPUSART1EN      (1 << 20) /* Bit 20: Low-power USART 1 enable */
#define RCC_APB1ENR_I2C1EN          (1 << 21) /* Bit 21: I2C 1 enable */
#define RCC_APB1ENR_I2C2EN          (1 << 22) /* Bit 22: I2C 2 enable */
                                              /* Bit 23: Reserved */
#define RCC_APB1ENR_CECEN           (1 << 24) /* Bit 24: HDMI CEC enable */
#define RCC_APB1ENR_UCPD1EN         (1 << 25) /* Bit 25: UCPD1 enable */
#define RCC_APB1ENR_UCPD2EN         (1 << 26) /* Bit 26: UCPD2 enable */
#define RCC_APB1ENR_DBGEN           (1 << 27) /* Bit 27: DBG enable */
#define RCC_APB1ENR_PWREN           (1 << 28) /* Bit 28: PWR enable */
#define RCC_APB1ENR_DAC1EN          (1 << 29) /* Bit 29: DAC1 enable */
#define RCC_APB1ENR_LPTIM2EN        (1 << 30) /* Bit 30: LPTIM2 enable */
#define RCC_APB1ENR_LPTIM1EN        (1 << 31) /* Bit 31: LPTIM1 enable */

/* APB2 Peripheral Clock enable register */

#define RCC_APB2ENR_SYSCFGEN        (1 << 0)  /* Bit 0:  System configuration controller enable */
                                              /* Bits 1-10: Reserved */
#define RCC_APB2ENR_TIM1EN          (1 << 11) /* Bit 11: TIM1 timer enable */
#define RCC_APB2ENR_SPI1EN          (1 << 12) /* Bit 12: SPI 1 enable */
                                              /* Bit 13: Reserved */
#define RCC_APB2ENR_USART1EN        (1 << 14) /* Bit 14: USART1 enable */
#define RCC_APB2ENR_TIM14EN         (1 << 15) /* Bit 15: TIM14 timer enable */
#define RCC_APB2ENR_TIM15EN         (1 << 16) /* Bit 16: TIM15 timer enable */
#define RCC_APB2ENR_TIM16EN         (1 << 17) /* Bit 17: TIM16 timer enable */
#define RCC_APB2ENR_TIM17EN         (1 << 18) /* Bit 18: TIM17 timer enable */
                                              /* Bit 19: Reserved */
#define RCC_APB2ENR_ADC1EN          (1 << 20) /* Bit 20: ADC1 timer enable */

/* GPIO clock enable in Sleep mode register */

/* AHB peripheral clock enable in Sleep mode register */

#define RCC_AHBSMENR_DMA1SMEN       (1 << 0)  /* Bit 0: DMA 1 enable in Sleep mode */
#define RCC_AHBSMENR_DMA2SMEN       (1 << 1)  /* Bit 1: DMA 2 enable in Sleep mode */
                                              /* Bits 2-7: Reserved */
#define RCC_AHBSMENR_MIFSMEN        (1 << 8)  /* Bit 8: Memory interface enable in Sleep mode */
                                              /* Bits 9-11: Reserved */
#define RCC_AHBSMENR_CRCSMEN        (1 << 12) /* Bit 12: Memory interface enable in Sleep mode */
                                              /* Bits 13-15: Reserved */
#define RCC_AHBSMENR_AESSMEN        (1 << 16) /* Bit 16: Touch sensing enable in Sleep mode */
                                              /* Bit 17: Reserved */
#define RCC_AHBSMENR_RNGSMEN        (1 << 18) /* Bit 18: Random number generator module enable in Sleep mode */
                                              /* Bits 19-31: Reserved */

/* TODO: APB1 peripheral clock enable in Sleep mode register */

/* TODO: APB2 peripheral clock enable in Sleep mode register */

/* TODO: Clock configuration register */

#define RCC_CCIPR_ADCSEL_SHIFT      (30)
#define RCC_CCIPR_ADCSEL_MASK       (3 << RCC_CCIPR_ADCSEL_SHIFT)
#define RCC_CCIPR_ADCSEL_SYSCLK     (0)
#define RCC_CCIPR_ADCSEL_PLLPCLK    (1 << RCC_CCIPR_ADCSEL_SHIFT)
#define RCC_CCIPR_ADCSEL_HSI16      (2 << RCC_CCIPR_ADCSEL_SHIFT)

/* TODO: RTC domain control register */

/* Control/status register */

#define RCC_CSR_LSION                   (1 << 0)  /* Bit 0: LSI enable */
#define RCC_CSR_LSIRDY                  (1 << 1)  /* Bit 1: ready */
                                                  /* Bits 2-22: Reserved */
#define RCC_CSR_RMVF                    (1 << 23) /* Bit 23: Remove reset flag */
                                                  /* Bit 24: Reserved */
#define RCC_CSR_OBLRSTF                 (1 << 25) /* Bit 25: Options bytes loading reset flag */
#define RCC_CSR_PINRSTF                 (1 << 26) /* Bit 26: PIN reset flag */
#define RCC_CSR_PORRSTF                 (1 << 27) /* Bit 27: POR/PDR reset flag */
#define RCC_CSR_SFTRSTF                 (1 << 28) /* Bit 28: software reset flag */
#define RCC_CSR_IWDGRSTF                (1 << 29) /* Bit 29: IWDG reset flag */
#define RCC_CSR_WWDGRSTF                (1 << 30) /* Bit 30: WWDG reset flag */
#define RCC_CSR_LPWRRSTF                (1 << 31) /* Bit 31: Low-power reset flag */

#endif /* __ARCH_ARM_SRC_STM32G0_HARDWARE_STM32G0_RCC_H */
